# 미니프로젝트 1번

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[869,374,569,197],
                   [578,286,427,89],
                   [321,148,335,66]],
                  index = ['서울지점','부산지점','제주지점'],
                  columns=['컴퓨터','모니터','노트북','스마트폰']
                 )
df

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197
부산지점  578  286  427    89
제주지점  321  148  335    66

In [4]:
df.iloc[0]

컴퓨터     869
모니터     374
노트북     569
스마트폰    197
Name: 서울지점, dtype: int64

In [5]:
df.loc['제주지점']

컴퓨터     321
모니터     148
노트북     335
스마트폰     66
Name: 제주지점, dtype: int64

In [6]:
df.loc[:,'노트북']

서울지점    569
부산지점    427
제주지점    335
Name: 노트북, dtype: int64

# 미니프로젝트 2번

In [20]:
import pandas as pd
df = pd.DataFrame([
                  ['서울지점',869,374,569,197],
                  ['부산지점',578,286,427,89],
                  ['제주지점',321,148,335,66]],
                 columns=['지점','컴퓨터','모니터','노트북','스마트폰']
                 )
df

     지점  컴퓨터  모니터  노트북  스마트폰
0  서울지점  869  374  569   197
1  부산지점  578  286  427    89
2  제주지점  321  148  335    66

In [21]:
df.지점

0    서울지점
1    부산지점
2    제주지점
Name: 지점, dtype: object

In [22]:
df[['지점','노트북']]

     지점  노트북
0  서울지점  569
1  부산지점  427
2  제주지점  335

In [23]:
df[:]

     지점  컴퓨터  모니터  노트북  스마트폰
0  서울지점  869  374  569   197
1  부산지점  578  286  427    89
2  제주지점  321  148  335    66

# 미니프로젝트 3번

In [24]:
import pandas as pd
df = pd.DataFrame([
                  ['서울지점',869,374,569],
                  ['제주지점',321,148,335]],
                 columns=['지점명','컴퓨터','모니터','노트북']
                 )
df.set_index('지점명',inplace=True)
df['스마트폰'] = 0
df.loc[['서울지점'],'스마트폰'] = 197
df.iloc[1,3] = 66
df

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569   197
제주지점  321  148  335    66